indianagio/sk6812-sniffer/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32h2"

# Use UART0 as console (goes to CP2102N → UART USB-C port)
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_UART_BAUDRATE=921600
CONFIG_ESP_CONSOLE_USB_CDC=n

# RMT ISR in IRAM for reliability
CONFIG_RMT_ISR_IRAM_SAFE=y

# Increase UART TX buffer
CONFIG_UART_ISR_IN_IRAM=y
